# Создайте программу для игры с конфетами человек против человека.

# Условие задачи: На столе лежит 2021 конфета. 
# Играют два игрока делая ход друг после друга. 
# Первый ход определяется жеребьёвкой. За один ход можно забрать не более чем 28 конфет. 
# Все конфеты оппонента достаются сделавшему последний ход. 
# Сколько конфет нужно взять первому игроку, чтобы забрать все конфеты у своего конкурента?

# a) Добавьте игру против бота

# b) Подумайте как наделить бота "интеллектом""

text_1 = f'На столе лежит 2023 конфет, конфеты берутся по очереди. \n\
Первый ход определяется жеребьёвкой. \n\
За один ход можно забрать не более чем 28 конфет. \n\
Побеждает игрок сделавший последний ход. \nУдачи и добро пожаловать!'